tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/SiLABS/REG51F970.H
/*-----------------------------------------------------------------------------
  REG51F970.H

Header file for Silabs C8051F97x devices.
Copyright (c) 2014 ARM Ltd and ARM Germnay GmbH.
All rights reserved.
-----------------------------------------------------------------------------*/

#ifndef __REG51F970_H__
#define __REG51F970_H__

/* Byte Registers */
/* SFRs all pages */
sfr P0          = 0x80;            /* Port 0 Latch                           */
sfr SP          = 0x81;            /* Stack Pointer                          */
sfr DPL         = 0x82;            /* Data Pointer Low                       */
sfr DPH         = 0x83;            /* Data Pointer High                      */
sfr PCON        = 0x87;            /* Power Control                          */
sfr PSCTL       = 0x8F;            /* Program Store R/W Control              */
sfr P1          = 0x90;            /* Port 1 Latch                           */
sfr SCON0       = 0x98;            /* UART0 Control                          */
sfr P2          = 0xA0;            /* Port 2 Latch                           */
sfr SFRPAGE     = 0xA7;            /* SFR Page                               */
sfr IE          = 0xA8;            /* Interrupt Enable                       */
sfr SFRLAST     = 0xB3;            /* SFR Page Last                          */
sfr FLKEY       = 0xB7;            /* Flash Lock And Key                     */
sfr IP          = 0xB8;            /* Interrupt Priority                     */
sfr ADC0PWR     = 0xBB;            /* ADC0 Power Control                     */
sfr ADC0TK      = 0xBC;            /* ADC0 Burst Mode Track Time             */
sfr TMR2CN      = 0xC8;            /* Timer/Counter 2 Control                */
sfr PSW         = 0xD0;            /* Program Status Word                    */
sfr ACC         = 0xE0;            /* Accumulator                            */
sfr FLWR        = 0xE5;            /* Flash write only                       */
sfr EIE1        = 0xE6;            /* Extended Interrupt Enable 1            */
sfr EIE2        = 0xE7;            /* Extended Interrupt Enable 2            */
sfr B           = 0xF0;            /* B Register                             */
sfr SFRNEXT     = 0xF3;            /* SFR Page Next                          */


/* SFRs page 0x0 */
sfr CRC0CN      = 0x84;            /* CRC0 Automatic Flash Sector Count      */
sfr CRC0IN      = 0x85;            /* CRC0 Data Input                        */
sfr CRC0DAT     = 0x86;            /* CRC0 Data Output                       */
sfr TCON       =  0x88;            /* Timer 0/1 Control                      */
sfr TMOD        = 0x89;            /* Timer/Counter Mode                     */
sfr TL0         = 0x8A;            /* Timer/Counter 0 Low                    */
sfr TL1         = 0x8B;            /* Timer/Counter 1 Low                    */
sfr TH0         = 0x8C;            /* Timer/Counter 0 High                   */
sfr TH1         = 0x8D;            /* Timer/Counter 1 High                   */
sfr CKCON       = 0x8E;            /* Clock Control                          */
sfr TMR3CN      = 0x91;            /* Timer/Counter 3 Control                */
sfr TMR3RLL     = 0x92;            /* Timer/Counter 3 Reload Low             */
sfr TMR3RLH     = 0x93;            /* Timer/Counter 3 Reload High            */
sfr TMR3L       = 0x94;            /* Timer/Counter 3 Low                    */
sfr TMR3H       = 0x95;            /* Timer/Counter 3 High                   */
sfr CS0PM       = 0x96;            /* Capacitive Sense 0 Pin Monitor         */
sfr ADC0CF      = 0x97;            /* ADC0 Configuration                     */
sfr SBUF0       = 0x99;            /* UART0 Data Buffer                      */
sfr AMUX0P0     = 0x9A;            /* Port 0 Analog Multiplexer Control      */
sfr AMUX0P1     = 0x9B;            /* Port 1 Analog Multiplexer Control      */
sfr AMUX0P2     = 0x9C;            /* Port 2 Analog Multiplexer Control      */
sfr CRC0CNT     = 0x9D;            /* CRC0 Automatic Flash Sector Count      */
sfr CRC0AUTO    = 0x9E;            /* CRC0 Automatic Control                 */
sfr CRC0FLIP    = 0x9F;            /* CRC0 Bit Flip                          */
sfr SPI0CFG     = 0xA1;            /* SPI0 Configuration                     */
sfr SPI0CKR     = 0xA2;            /* SPI0 Clock Rate Control                */
sfr SPI0DAT     = 0xA3;            /* SPI0 Data                              */
sfr AMUX0P3     = 0xA4;            /* Port 3 Analog Multiplexer Control      */
sfr AMUX0P4     = 0xA5;            /* Port 4 Analog Multiplexer Control      */
sfr AMUX0P5     = 0xA6;            /* Port 5 Analog Multiplexer Control      */
sfr CLKSEL      = 0xA9;            /* Clock Select; Also on SFR page 0xF     */
sfr CS0CF       = 0xAA;            /* Capacitive Sense 0 Configuration       */
sfr CS0MX       = 0xAB;            /* Capacitive Sense 0 Mux Channel Select  */
sfr RTC0ADR     = 0xAC;            /* RTC0 Address                           */
sfr RTC0DAT     = 0xAD;            /* RTC0 Data                              */
sfr OSCICL      = 0xAF;            /* High Frequency Oscillator Calibration  */
sfr CS0CN       = 0xB0;            /* Capacitive Sense 0 Control             */
sfr OSCXCN      = 0xB1;            /* External Oscillator Control            */
sfr OSCICN      = 0xB2;            /* Internal Oscillator Control            */
sfr PMU0CF      = 0xB5;            /* Power Management Unit 0 Configuration  */
sfr FLSCL       = 0xB6;            /* Flash Scale                            */
sfr EMI0CN      = 0xB9;            /* External Memory Interface Control      */
sfr ADC0AC      = 0xBA;            /* ADC0 Accumulator Configuration         */
sfr CS0MD1      = 0xBD;            /* Capacitive Sense 0 Mode 1              */
sfr CS0MD2      = 0xBE;            /* Capacitive Sense 0 Mode 2              */
sfr CS0MD3      = 0xBF;            /* Capacitive Sense 0 Mode 3              */
sfr SMB0CN      = 0xC0;            /* SMBus0 Control                         */
sfr SMB0CF      = 0xC1;            /* SMBus0 Configuration                   */
sfr SMB0DAT     = 0xC2;            /* SMBus0 Data                            */
sfr ADC0GTL     = 0xC3;            /* ADC0 Greater-Than Compare Low          */
sfr ADC0GTH     = 0xC4;            /* ADC0 Greater-Than Compare High         */
sfr ADC0LTL     = 0xC5;            /* ADC0 Less-Than Compare Word Low        */
sfr ADC0LTH     = 0xC6;            /* ADC0 Less-Than Compare Word High       */
sfr REG0CN      = 0xC9;            /* Voltage Regulator REG0 Control         */
sfr TMR2RLL     = 0xCA;            /* Timer/Counter 2 Reload Low             */
sfr TMR2RLH     = 0xCB;            /* Timer/Counter 2 Reload High            */
sfr TMR2L       = 0xCC;            /* Timer/Counter 2 Low                    */
sfr TMR2H       = 0xCD;            /* Timer/Counter 2 High                   */
sfr PMU0FL      = 0xCE;            /* Power Management Unit Flag             */
sfr PMU0MD      = 0xCF;            /* Power Management Unit Mode             */
sfr REF0CN      = 0xD1;            /* Voltage Reference Control              */
sfr ADC0L       = 0xD2;            /* ADC0 Data Word Low Byte                */
sfr ADC0H       = 0xD3;            /* ADC0 Data Word High Byte               */
sfr ADC0MX      = 0xD4;            /* ADC0 Multiplexer Selection             */
sfr PCA0CN      = 0xD8;            /* PCA Control                            */
sfr PCA0MD      = 0xD9;            /* PCA0 Mode                              */
sfr PCA0CPM0    = 0xDA;            /* PCA0 Module 0 Mode Register            */
sfr PCA0CPM1    = 0xDB;            /* PCA0 Module 1 Mode Register            */
sfr PCA0CPM2    = 0xDC;            /* PCA0 Module 2 Mode Register            */
sfr CS0SS       = 0xDD;            /* Capacitive Sense 0 Auto Scan Start Channel    */
sfr CS0SE       = 0xDE;            /* Capacitive Sense 0 Auto Scan End Channel      */
sfr PCA0PWM     = 0xDF;            /* PCA0 PWM Configuration                 */
sfr P3          = 0xE1;            /* Port I/O Crossbar Control 0            */
sfr P4          = 0xE2;            /* Port I/O Crossbar Control 1            */
sfr P5          = 0xE3;            /* Port I/O Crossbar Control 2            */
sfr P6          = 0xE4;            /* INT0/INT1 Configuration                */
sfr ADC0CN      = 0xE8;            /* ADC0 Control                           */
sfr PCA0CPL1    = 0xE9;            /* PCA0 Capture 1 Low                     */
sfr PCA0CPH1    = 0xEA;            /* PCA0 Capture 1 High                    */
sfr PCA0CPL2    = 0xEB;            /* PCA0 Capture 2 Low                     */
sfr PCA0CPH2    = 0xEC;            /* PCA0 Capture 2 High                    */
sfr CS0DL       = 0xED;            /* Capacitive Sense 0 Data Low Byte       */
sfr CS0DH       = 0xEE;            /* Capacitive Sense 0 Data High Byte      */
sfr RSTSRC      = 0xEF;            /* Reset Source                           */
sfr SMB0ADR     = 0xF4;            /* SMBus Slave Address                    */
sfr SMB0ADM     = 0xF5;            /* SMBus Slave Address Mask               */
sfr PCLKEN      = 0xF6;            /* Low Power Peripheral Clock Enable      */
sfr CLKMODE     = 0xF7;            /* Clock Mode                             */
sfr SPI0CN      = 0xF8;            /* SPI0 Control                           */
sfr PCA0L       = 0xF9;            /* PCA0 Counter Low                       */
sfr PCA0H       = 0xFA;            /* PCA0 Counter High                      */
sfr PCA0CPL0    = 0xFB;            /* PCA0 Capture 0 Low                     */
sfr PCA0CPH0    = 0xFC;            /* PCA0 Capture 0 High                    */
sfr CS0THL      = 0xFD;            /* Capacitive Sense 0 Comparator Threshold Low Byte    */
sfr CS0THH      = 0xFE;            /* Capacitive Sense 0 Comparator Threshold High Byte   */
sfr VDM0CN      = 0xFF;            /* Supply Monitor Control                 */


/* SFRs page 0xF */
sfr P2MASK      = 0x80;            /* Port 2 Mask                            */
sfr P2MAT       = 0x80;            /* Port 2 Match                           */
sfr DMA0MINT    = 0x88;            /* DMA0 Mid-Point Interrupt Flags         */
sfr P0MASK      = 0x8B;            /* Port 0 Mask                            */
sfr P1MASK      = 0x8C;            /* Port 1 Mask                            */
sfr TOFFL       = 0x8D;            /* Temperature Sensor Offset Low          */
sfr TOFFH       = 0x8E;            /* Temperature Sensor Offset High         */
sfr DMA0BUSY    = 0x91;            /* DMA0 Busy                              */
sfr DMA0EN      = 0x92;            /* DMA0 Channel Enable                    */
sfr DMA0SEL     = 0x94;            /* DMA0 Channel Select                    */
sfr XBR0        = 0x95;            /* Port I/O Crossbar 0                    */
sfr XBR1        = 0x96;            /* Port I/O Crossbar 1                    */
sfr P6MDIN      = 0x97;            /* Port 6 Input Mode                      */
sfr P0DRV       = 0x99;            /* Port 0 Drive Strength                  */
sfr P1DRV       = 0x9A;            /* Port 1 Drive Strength                  */
sfr P2DRV       = 0x9B;            /* Port 2 Drive Strength                  */
sfr P3DRV       = 0x9C;            /* Port 3 Drive Strength                  */
sfr P5DRV       = 0x9D;            /* Port 5 Drive Strength                  */
sfr I2C0DOUT    = 0xA4;            /* I2C0 Transmit Data                     */
sfr I2C0DIN     = 0xA5;            /* I2C0 Received Data                     */
sfr SFRPGCN     = 0xA6;            /* SFR Page Control                       */
sfr MAC0AL      = 0xAA;            /* Operand A Low Byte                     */
sfr MAC0AH      = 0xAB;            /* Operand A High Byte                    */
sfr I2C0CN      = 0xAC;            /* I2C0 Control                           */
sfr I2C0SLAD    = 0xAD;            /* I2C0 Slave Address                     */
sfr MAC0BL      = 0xAE;            /* Operand B Low Byte                     */
sfr MAC0BH      = 0xAF;            /* Operand B High Byte                    */
sfr P0SKIP      = 0xB6;            /* Port 0 Skip                            */
sfr P4DRV       = 0xB9;            /* Port 4 Drive Strength                  */
sfr MAC0CF0     = 0xC0;            /* MAC0 Configuration 0                   */
sfr MAC0INTE    = 0xC1;            /* MAC0 Interrupt Enable                  */
sfr P4MDOUT     = 0xC3;            /* Port 4 Output Mode                     */
sfr MAC0CF1     = 0xC4;            /* MAC0 Configuration 1                   */
sfr MAC0CF2     = 0xC5;            /* MAC0 Configuration 2                   */
sfr P1SKIP      = 0xC6;            /* Port 1 Skip                            */
sfr P2SKIP      = 0xC7;            /* Port 2 Skip                            */
sfr DMA0NBAL    = 0xC9;            /* Memory Base Address Low                */
sfr DMA0NBAH    = 0xCA;            /* Memory Base Address High               */
sfr DMA0NAOL    = 0xCB;            /* Memory Address Offset Low              */
sfr DMA0NAOH    = 0xCC;            /* Memory Address Offset High             */
sfr DMA0NSZL    = 0xCD;            /* Memory Transfer Size Low               */
sfr DMA0NSZH    = 0xCE;            /* Memory Transfer Size High              */
sfr MAC0STA     = 0xCF;            /* MAC0 Status                            */
sfr MAC0ACC0    = 0xD2;            /* Accumulator Byte 0                     */
sfr MAC0ACC1    = 0xD3;            /* Accumulator Byte 1                     */
sfr MAC0ACC2    = 0xD4;            /* Accumulator Byte 2                     */
sfr MAC0ACC3    = 0xD5;            /* Accumulator Byte 3                     */
sfr MAC0OVF     = 0xD6;            /* Accumulator Overflow Byte              */
sfr MAC0ITER    = 0xD7;            /* Iteration Counter                      */
sfr DMA0NCF     = 0xD8;            /* DMA0 Channel Configuration             */
sfr P0MDOUT     = 0xD9;            /* Port 0 Output Mode                     */
sfr P1MDOUT     = 0xDC;            /* Port 1 Output Mode                     */
sfr P2MDOUT     = 0xDD;            /* Port 2 Output Mode                     */
sfr IT01CF      = 0xDE;            /* INT0 / INT1 Configuration              */
sfr P3MDOUT     = 0xDF;            /* Port 3 Output Mode                     */
sfr DEVICEID    = 0xE1;            /* Device Identification                  */
sfr REVID       = 0xE2;            /* Revision Identification                */
sfr DMA0INT     = 0xE8;            /* DMA0 Full-Length Interrupt Flags       */
sfr P0MDIN      = 0xEC;            /* Port 0 Input Mode                      */
sfr P1MDIN      = 0xED;            /* Port 1 Input Mode                      */
sfr P2MDIN      = 0xEE;            /* Port 2 Input Mode                      */
sfr P3MDIN      = 0xEF;            /* Port 3 Input Mode                      */
sfr P4MDIN      = 0xF1;            /* Port 4 Input Mode                      */
sfr P5MDIN      = 0xF2;            /* Port 5 Input Mode                      */
sfr P0MAT       = 0xF4;            /* Port 0 Match                           */
sfr P1MAT       = 0xF5;            /* Port 1 Match                           */
sfr EIP1        = 0xF6;            /* Extended Interrupt Priority 1          */
sfr EIP2        = 0xF7;            /* Extended Interrupt Priority 2          */
sfr I2C0STAT    = 0xF8;            /* I2C0 Status                            */
sfr P5MDOUT     = 0xFF;            /* Port 5 Output Mode                     */


