tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/SiLABS/REG51F970.H
/* 16-bit Register definitions */

/* SFR Page 0x0 */
sfr16 DP        = 0x82;            /* Data Pointer                           */
sfr16 TMR3RL    = 0x92;            /* Timer 3 Reload                         */
sfr16 TMR3      = 0x94;            /* Timer 3 Counter                        */
sfr16 ADC0GT    = 0xC3;            /* ADC0 Greater-Than Compare              */
sfr16 ADC0LT    = 0xC5;            /* ADC0 Less-Than Compare                 */
sfr16 TMR2RL    = 0xCA;            /* Timer 2 Reload                         */
sfr16 TMR2      = 0xCC;            /* Timer 2 Counter                        */
sfr16 ADC0      = 0xD2;            /* ADC0 data                              */
sfr16 PCA0CP1   = 0xE9;            /* PCA0 Module 1 Capture/Compare          */
sfr16 PCA0CP2   = 0xEB;            /* PCA0 Module 2 Capture/Compare          */
sfr16 CS0D      = 0xED;            /* Capacitive Sense 0 data                */
sfr16 PCA0      = 0xF9;            /* PCA0 Counter                           */
sfr16 PCA0CP0   = 0xFB;            /* PCA0 Module 0 Capture/Compare          */
sfr16 CS0TH     = 0xFD;            /* Capacitive Sense 0 Comparator Threshold data */

/* SFR Page 0xF */
sfr16 TOFF       = 0xBD;           /* Temperature offset data                */
sfr16 MAC0A      = 0xAA;           /* MAC0 operand A                         */
sfr16 MAC0B      = 0xAE;           /* MAC0 operand B                         */
sfr16 DMA0NBA    = 0xC9;           /* Memory base address                    */
sfr16 DMA0NAO    = 0xCB;           /* Memory address offset                  */
sfr16 DMA0NSZ    = 0xCD;           /* Memory transfer size                   */


/* Bit Definitions */

/* SFRs all pages */
/* P0 0x80  SFR: all pages Port 0 latches 0-7*/
sbit B07      = P0^7;              /* Port0 Bit 7 Latch                      */
sbit B06      = P0^6;              /* Port0 Bit 6 Latch                      */
sbit B05      = P0^5;              /* Port0 Bit 5 Latch                      */
sbit B04      = P0^4;              /* Port0 Bit 4 Latch                      */
sbit B03      = P0^3;              /* Port0 Bit 3 Latch                      */
sbit B02      = P0^2;              /* Port0 Bit 2 Latch                      */
sbit B01      = P0^1;              /* Port0 Bit 1 Latch                      */
sbit B00      = P0^0;              /* Port0 Bit 0 Latch                      */

/* P1 0x90  SFR: all pages Port 1 latches 0-7*/
sbit B17      = P1^7;              /* Port1 Bit 7 Latch                      */
sbit B16      = P1^6;              /* Port1 Bit 6 Latch                      */
sbit B15      = P1^5;              /* Port1 Bit 5 Latch                      */
sbit B14      = P1^4;              /* Port1 Bit 4 Latch                      */
sbit B13      = P1^3;              /* Port1 Bit 3 Latch                      */
sbit B12      = P1^2;              /* Port1 Bit 2 Latch                      */
sbit B11      = P1^1;              /* Port1 Bit 1 Latch                      */
sbit B10      = P1^0;              /* Port1 Bit 0 Latch                      */

/* SCON0 0x98  SFR: all pages UART0 Serial Port Control */
sbit S0MODE   = SCON0^7;           /* UART0 Mode                             */
                                   /* Bit6 UNUSED                            */
sbit MCE      = SCON0^5;           /* UART0 Multi-Processor Communication    */
sbit REN      = SCON0^4;           /* UART0 RX Enable                        */
sbit TB8      = SCON0^3;           /* UART0 TX Bit 8                         */
sbit RB8      = SCON0^2;           /* UART0 RX Bit 8                         */
sbit TI       = SCON0^1;           /* UART0 TX Interrupt Flag                */
sbit RI       = SCON0^0;           /* UART0 RX Interrupt Flag                */

/* P2 0xA0  SFR: all pages Port 1 latches 0-7*/
sbit B27      = P2^7;              /* Port2 Bit 7 Latch                      */
sbit B26      = P2^6;              /* Port2 Bit 6 Latch                      */
sbit B25      = P2^5;              /* Port2 Bit 5 Latch                      */
sbit B24      = P2^4;              /* Port2 Bit 4 Latch                      */
sbit B23      = P2^3;              /* Port2 Bit 3 Latch                      */
sbit B22      = P2^2;              /* Port2 Bit 2 Latch                      */
sbit B21      = P2^1;              /* Port2 Bit 1 Latch                      */
sbit B20      = P2^0;              /* Port2 Bit 0 Latch                      */

/* IE 0xA8 SFR: all pages Interrupt Enable */
sbit EA       = IE^7;              /* Global Interrupt Enable                */
sbit ESPI0    = IE^6;              /* SPI0 Interrupt Enable                  */
sbit ET2      = IE^5;              /* Timer 2 Interrupt Enable               */
sbit ES0      = IE^4;              /* UART0 Interrupt Enable                 */
sbit ET1      = IE^3;              /* Timer 1 Interrupt Enable               */
sbit EX1      = IE^2;              /* External Interrupt 1 Enable            */
sbit ET0      = IE^1;              /* Timer 0 Interrupt Enable               */
sbit EX0      = IE^0;              /* External Interrupt 0 Enable            */


/* IP 0xB8 SFR: all pages Interrupt Priority */
                                   /* Bit7 UNUSED                            */
sbit PSPI0    = IP^6;              /* SPI0 Priority                          */
sbit PT2      = IP^5;              /* Timer 2 Priority                       */
sbit PS0      = IP^4;              /* UART0 Priority                         */
sbit PT1      = IP^3;              /* Timer 1 Priority                       */
sbit PX1      = IP^2;              /* External Interrupt 1 Priority          */
sbit PT0      = IP^1;              /* Timer 0 Priority                       */
sbit PX0      = IP^0;              /* External Interrupt 0 Priority          */

/* TMR2CN 0xC8 SFR: all pages Timer 2 Control */
sbit TF2H     = TMR2CN^7;          /* Timer 2 High Byte Overflow Flag        */
sbit TF2L     = TMR2CN^6;          /* Timer 2 Low Byte Overflow Flag         */
sbit TF2LEN   = TMR2CN^5;          /* Timer 2 Low Byte Interrupt Enable      */
sbit TF2CEN   = TMR2CN^4;          /* Timer 2 Lfo Capture Enable             */
sbit T2SPLIT  = TMR2CN^3;          /* Timer 2 Split Mode Enable              */
sbit TR2      = TMR2CN^2;          /* Timer 2 On/Off Control (run control)   */
sbit T2XCLK1  = TMR2CN^1;          /* Timer 2 External Clock Select. bit 1   */
sbit T2XCLK0  = TMR2CN^0;          /* Timer 2 External Clock Select. bit 0   */

/* PSW 0xD0 SFR: all pages Program Status Word */
sbit CY       = PSW^7;             /* Carry Flag                             */
sbit AC       = PSW^6;             /* Auxiliary Carry Flag                   */
sbit F0       = PSW^5;             /* User Flag 0                            */
sbit RS1      = PSW^4;             /* Register Bank Select 1                 */
sbit RS0      = PSW^3;             /* Register Bank Select 0                 */
sbit OV       = PSW^2;             /* Overflow Flag                          */
sbit F1       = PSW^1;             /* User Flag 1                            */
sbit P        = PSW^0;             /* Accumulator Parity Flag                */


/* SFR page 0x0 */

