tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/SiLABS/REG51F970.H
/* TCON 0x88  SFR page: 0x0 Timer 0/1 Control */
sbit TF1      = TCON^7;            /* Timer 1 Overflow Flag                  */
sbit TR1      = TCON^6;            /* Timer 1 On/Off Control                 */
sbit TF0      = TCON^5;            /* Timer 0 Overflow Flag                  */
sbit TR0      = TCON^4;            /* Timer 0 On/Off Control                 */
sbit IE1      = TCON^3;            /* Ext. Interrupt 1 Edge Flag             */
sbit IT1      = TCON^2;            /* Ext. Interrupt 1 Type                  */
sbit IE0      = TCON^1;            /* Ext. Interrupt 0 Edge Flag             */
sbit IT0      = TCON^0;            /* Ext. Interrupt 0 Type                  */

/* CS0CN 0xB0 SFR page: 0x0 Capacitive Sense 0 Control */
sbit CSEN     = CS0CN^7;           /* CS0 Enable                             */
sbit CSEOS    = CS0CN^6;           /* CS0 End of Scan Interrupt Flag         */
sbit CSINT    = CS0CN^5;           /* CS0 Interrupt Flag                     */
sbit CSBUSY   = CS0CN^4;           /* CS0 Busy                               */
sbit CSCMPEN  = CS0CN^3;           /* CS0 Digital Comparator Enable          */
                                   /* Bit2 UNUSED                            */
sbit CSPME    = CS0CN^1;           /* CS0 Pin Monitor Event                  */
sbit CSCMPF   = CS0CN^0;           /* CS0 Digital Comparator Interrupt Flag  */

/* SMB0CN 0xC0 SFR page: 0x0 SMBus 0 Control */
sbit MASTER   = SMB0CN^7;          /* SMBus0 Master/Slave                    */
sbit TXMODE   = SMB0CN^6;          /* SMBus0 Transmit Mode                   */
sbit STA      = SMB0CN^5;          /* SMBus0 Start Flag                      */
sbit STO      = SMB0CN^4;          /* SMBus0 Stop Flag                       */
sbit ACKRQ    = SMB0CN^3;          /* SMBus0 Acknowledge Request             */
sbit ARBLOST  = SMB0CN^2;          /* SMBus0 Arbitration Lost                */
sbit ACK      = SMB0CN^1;          /* SMBus0 Acknowledge Flag                */
sbit SI       = SMB0CN^0;          /* SMBus0 Interrupt Pending Flag          */

/* PCA0CN 0xD8 SFR page: 0x0 PCA Control*/
sbit CF       = PCA0CN^7;          /* PCA0 Counter Overflow Flag             */
sbit CR       = PCA0CN^6;          /* PCA0 Counter Run Control Bit           */
                                   /* Bit 5 reserved                         */
                                   /* Bit 4 reserved                         */
                                   /* Bit 3 reserved                         */
sbit CCF2     = PCA0CN^2;          /* PCA0 Module 2 Interrupt Flag           */
sbit CCF1     = PCA0CN^1;          /* PCA0 Module 1 Interrupt Flag           */
sbit CCF0     = PCA0CN^0;          /* PCA0 Module 0 Interrupt Flag           */

/* ADC0CN 0xE8 SFR page: 0x0 ADC0 Control */
sbit ADEN     = ADC0CN^7;          /* ADC  Enable                            */
sbit ADBMEN   = ADC0CN^6;          /* ADC0 Burst Enable                      */
sbit ADINT    = ADC0CN^5;          /* ADC0 Conversion Complete Interrupt Flag*/
sbit ADBUSY   = ADC0CN^4;          /* ADC0 Busy Flag                         */
sbit ADWINT   = ADC0CN^3;          /* ADC0 Window Interrupt Flag             */
sbit ADCM2    = ADC0CN^2;          /* ADC0 Convert Start Mode Bit 2          */
sbit ADCM1    = ADC0CN^1;          /* ADC0 Convert Start Mode Bit 1          */
sbit ADCM0    = ADC0CN^0;          /* ADC0 Convert Start Mode Bit 0          */

/* SPI0CN 0xF8, SFR-Page 0x0 SPI0 Control */
sbit SPIF     = SPI0CN^7;          /* SPI0 Interrupt Flag                    */
sbit WCOL     = SPI0CN^6;          /* SPI0 Write Collision Flag              */
sbit MODF     = SPI0CN^5;          /* SPI0 Mode Fault Flag                   */
sbit RXOVRN   = SPI0CN^4;          /* SPI0 RX Overrun Flag                   */
sbit NSSMD1   = SPI0CN^3;          /* SPI0 Slave Select Mode 1               */
sbit NSSMD0   = SPI0CN^2;          /* SPI0 Slave Select Mode 0               */
sbit TXBMT    = SPI0CN^1;          /* SPI0 TX Buffer Empty Flag              */
sbit SPIEN    = SPI0CN^0;          /* SPI0 Enable                            */


/* SFR page 0xF */

/* DMA0MINT 0x88 SFR page: 0xF DMA0 Mid-Point Interrupt Flags */
                                   /* Bit 7 reserved                         */
sbit CH6MI    = DMA0MINT^6;        /* Channel 6 Mid-Point Interrupt Flag     */
sbit CH5MI    = DMA0MINT^5;        /* Channel 5 Mid-Point Interrupt Flag     */
sbit CH4MI    = DMA0MINT^4;        /* Channel 4 Mid-Point Interrupt Flag     */
sbit CH3MI    = DMA0MINT^3;        /* Channel 3 Mid-Point Interrupt Flag     */
sbit CH2MI    = DMA0MINT^2;        /* Channel 2 Mid-Point Interrupt Flag     */
sbit CH1MI    = DMA0MINT^1;        /* Channel 1 Mid-Point Interrupt Flag     */
sbit CH0MI    = DMA0MINT^0;        /* Channel 0 Mid-Point Interrupt Flag     */

/* MAC0CF0 0xC0 SFR page: 0xF MAC0 Configuration 0  */
sbit SHIFTEN    = MAC0CF0^7;       /* Accumulator Shift Control              */
sbit SHIFTDIR   = MAC0CF0^6;       /* Accumulator Shift Direction            */
sbit CLRACC     = MAC0CF0^5;       /* Clear Accumulator                      */
sbit FRACMD     = MAC0CF0^4;       /* Fractional Mode                        */
sbit ACCMD      = MAC0CF0^3;       /* Accumulate Mode                        */
sbit ACCNEGATE  = MAC0CF0^2;       /* Negate Accumulator Input               */
sbit BNEGATE    = MAC0CF0^1;       /* Negate MAC0 B input                    */
sbit ANEGATE    = MAC0CF0^0;       /* Negate MAC0 A input                    */

/* DMA0NCF 0xD8 SFR page: 0xF DMA0 Channel Configuration */
sbit IEN      = DMA0NCF^7;         /* Full-Length Interrupt Enable           */
sbit MIEN     = DMA0NCF^6;         /* Mid-Point Interrupt Enable             */
sbit STALL    = DMA0NCF^5;         /* Channel Stall                          */
sbit ENDIAN   = DMA0NCF^4;         /* Data Transfer Endianness               */
                                   /* Bit 3 reserved                         */
sbit PERIPH2  = DMA0NCF^2;         /* Peripheral Transfer Select bit  2      */
sbit PERIPH1  = DMA0NCF^1;         /* Peripheral Transfer Select bit  1      */
sbit PERIPH0  = DMA0NCF^0;         /* Peripheral Transfer Select bit  0      */

