tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/SiLABS/REG51F970.H
/* DMA0INT 0xE8 SFR page: 0xF DMA0 Full-Length Interrupt Flags */
                                   /* Bit 7 reserved                         */
sbit CH6I     = DMA0INT^6;         /* Channel 6 Full-Length Interrupt Flag   */
sbit CH5I     = DMA0INT^5;         /* Channel 5 Full-Length Interrupt Flag   */
sbit CH4I     = DMA0INT^4;         /* Channel 4 Full-Length Interrupt Flag   */
sbit CH3I     = DMA0INT^3;         /* Channel 3 Full-Length Interrupt Flag   */
sbit CH2I     = DMA0INT^2;         /* Channel 2 Full-Length Interrupt Flag   */
sbit CH1I     = DMA0INT^1;         /* Channel 1 Full-Length Interrupt Flag   */
sbit CH0I     = DMA0INT^0;         /* Channel 0 Full-Length Interrupt Flag   */

/* I2C0STAT 0xF8, SFR-Page 0xF I2C0 Status */
sbit HSMODE   = I2C0STAT^7;        /* High Speed Mode                        */
sbit ACTIVE   = I2C0STAT^6;        /* Bus Active                             */
sbit I2C0INT  = I2C0STAT^5;        /* I2C Interrupt                          */
sbit NACK     = I2C0STAT^4;        /* NACK                                   */
sbit START    = I2C0STAT^3;        /* Start                                  */
sbit STOP     = I2C0STAT^2;        /* Stop                                   */
sbit WR       = I2C0STAT^1;        /* I2C Write                              */
sbit RD       = I2C0STAT^0;        /* I2C Read                               */


/* Interrupt Priorities */
#define INTERRUPT_INT0             0  /* External Interrupt 0                */
#define INTERRUPT_TIMER0           1  /* Timer0 Overflow                     */
#define INTERRUPT_INT1             2  /* External Interrupt 1                */
#define INTERRUPT_TIMER1           3  /* Timer1 Overflow                     */
#define INTERRUPT_UART0            4  /* Serial Port 0                       */
#define INTERRUPT_TIMER2           5  /* Timer2 Overflow                     */
#define INTERRUPT_SPI0             6  /* Serial Peripheral Interface 0       */
#define INTERRUPT_SMBUS0           7  /* SMBus0 Interface                    */
#define INTERRUPT_RTC0ALARM        8  /* RTC0 (SmaRTClock) Alarm             */
#define INTERRUPT_ADC0_WINDOW      9  /* ADC0 Window Comparison              */
#define INTERRUPT_ADC0_EOC         10 /* ADC0 End Of Conversion              */
#define INTERRUPT_PCA0             11 /* PCA0 Peripheral                     */
#define INTERRUPT_DMA0_MIDPOINT    12 /* Comparator0                         */
#define INTERRUPT_DMA0_ENDPOINT    13 /* Comparator1                         */
#define INTERRUPT_TIMER3           14 /* Timer3 Overflow                     */
/* ------------------------------- 15 -------------------------------------- */
#define INTERRUPT_PORT_MATCH       16 /* Port Match                          */
#define INTERRUPT_RTC0_OSC_FAIL    17 /* RTC0 (smaRTClock) Osc. Fail         */
#define INTERRUPT_MAC0             18 /* MAC0                                */
#define INTERRUPT_CS0_CONVERSION   19 /* CS0 Conversion complete             */
#define INTERRUPT_CS0_DIG_COMP     20 /* CS0 digital comparator              */
#define INTERRUPT_CS0_EOS          21 /* CS0 End of scan 0                   */
#define INTERRUPT_I2C_SLV0         22 /* I2C slave 0                         */


#endif                                /* #define __REG51F970_H__             */